In [1]:
import sqlite3

def sql_i(instruction,data_b="data.db"):
    conn=sqlite3.connect(data_b)#data.db will open or create data base data.db
    cur=conn.cursor()
    cur.execute(instruction)#execute the instuction:"CREATE TABLE IF NOT EXISTS PET (ID INTEGER NOT NULL,ANIMAL TEXT,QUANTITY INTEGER)"
    if "select" in instruction.lower() or "pragma" in instruction.lower():
        rows=cur.fetchall()
        conn.close()
        return(rows)
    else:
        conn.commit()  
        conn.close()

In [2]:
sql_i("CREATE TABLE IF NOT EXISTS PET (ID INTEGER NOT NULL,ANIMAL TEXT,QUANTITY INTEGER)")

In [3]:
sql_i('''
CREATE TABLE IF NOT EXISTS PETSALE (ID INTEGER NOT NULL ,
                                 PET TEXT ,
                                 SALEPRICE REAL ,
                                 PROFIT REAL ,
                                 SALEDATE DATE)
                                 ''')

In [4]:
sql_i('''
INSERT INTO PETSALE VALUES
    (1,'Cat',450.09,100.47,'2018-05-29'),
    (2,'Dog',666.66,150.76,'2018-06-01'),
    (3,'Parrot',50.00,8.9,'2018-06-04'),
    (4,'Hamster',60.60,12,'2018-06-11'),
    (5,'Goldfish',48.48,3.5,'2018-06-14')
    ''')

In [5]:
sql_i("INSERT INTO PET VALUES (1,'Cat',3),(2,'Dog',4),(3,'Hamster',2)")

In [6]:
output1=sql_i("SELECT * FROM PET")
print(output1)

[(1, 'Cat', 3), (2, 'Dog', 4), (3, 'Hamster', 2)]

In [7]:
output2=sql_i("SELECT * FROM PETSALE")
print(output2)

[(1, 'Cat', 450.09, '2018-05-29', 9), (2, 'Dog', 666.66, '2018-06-01', 3), (3, 'Parrot', 50.0, '2018-06-04', 2), (4, 'Hamster', 60.6, '2018-06-11', 6), (5, 'Goldfish', 48.48, '2018-06-14', 24), (1, 'Cat', 450.09, 100.47, '2018-05-29'), (2, 'Dog', 666.66, 150.76, '2018-06-01'), (3, 'Parrot', 50.0, 8.9, '2018-06-04'), (4, 'Hamster', 60.6, 12, '2018-06-11'), (5, 'Goldfish', 48.48, 3.5, '2018-06-14')]

# create pandas data frame from table pet

In [8]:
import pandas as pd
df=pd.DataFrame(output1)
df

   0        1  2
0  1      Cat  3
1  2      Dog  4
2  3  Hamster  2

In [9]:
columns=sql_i("PRAGMA table_info('PET')")
columns

[(0, 'ID', 'INTEGER', 1, None, 0),
 (1, 'ANIMAL', 'TEXT', 0, None, 0),
 (2, 'QUANTITY', 'INTEGER', 0, None, 0)]

In [10]:
head=[]
for name in columns:#[(0, 'ID', 'INTEGER', 1, None, 0),(1, 'ANIMAL', 'TEXT', 0, None, 0),(2, 'QUANTITY', 'INTEGER', 0, None, 0)]
    head.append(name[1])
head

['ID', 'ANIMAL', 'QUANTITY']

In [11]:
df=pd.DataFrame(output1,columns=head)
df

   ID   ANIMAL  QUANTITY
0   1      Cat         3
1   2      Dog         4
2   3  Hamster         2

# Task A: ALTER using ADD COLUMN

In [29]:
#Add a new QUANTITY column to the PETSALE table and show the altered table.
sql_i("ALTER TABLE PETSALE ADD COLUMN QUANTITY1 INTEGER")
petsale=sql_i("SELECT * FROM PETSALE")
petsale

[(1, 'Cat', 450.09, '2018-05-29', 9, None),
 (2, 'Dog', 666.66, '2018-06-01', 3, None),
 (3, 'Parrot', 50.0, '2018-06-04', 2, None),
 (4, 'Hamster', 60.6, '2018-06-11', 6, None),
 (5, 'Goldfish', 48.48, '2018-06-14', 24, None),
 (1, 'Cat', 450.09, 100.47, 9, None),
 (2, 'Dog', 666.66, 150.76, 3, None),
 (3, 'Parrot', 50.0, 8.9, 2, None),
 (4, 'Hamster', 60.6, 12, 6, None),
 (5, 'Goldfish', 48.48, 3.5, 24, None)]

# how to add columns names  ?

In [30]:
columns=sql_i("PRAGMA table_info('PETSALE')")
columns

[(0, 'ID', 'INTEGER', 1, None, 0),
 (1, 'ANIMAL', 'TEXT', 0, None, 0),
 (2, 'SALEPRICE', 'REAL', 0, None, 0),
 (3, 'SALEDATE', 'DATE', 0, None, 0),
 (4, 'QUANTITY', 'INTEGER', 0, None, 0),
 (5, 'QUANTITY1', 'INTEGER', 0, None, 0)]

In [31]:
head=[]
for name in columns:
    head.append(name[1])
head

['ID', 'ANIMAL', 'SALEPRICE', 'SALEDATE', 'QUANTITY', 'QUANTITY1']

In [32]:
petsale = sql_i("SELECT * FROM petsale")
petsale=pd.DataFrame(petsale,columns=head)
petsale

   ID    ANIMAL  SALEPRICE    SALEDATE  QUANTITY QUANTITY1
0   1       Cat     450.09  2018-05-29         9      None
1   2       Dog     666.66  2018-06-01         3      None
2   3    Parrot      50.00  2018-06-04         2      None
3   4   Hamster      60.60  2018-06-11         6      None
4   5  Goldfish      48.48  2018-06-14        24      None
5   1       Cat     450.09      100.47         9      None
6   2       Dog     666.66      150.76         3      None
7   3    Parrot      50.00         8.9         2      None
8   4   Hamster      60.60          12         6      None
9   5  Goldfish      48.48         3.5        24      None

In [33]:
sql_i("UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 1")
sql_i("UPDATE PETSALE SET QUANTITY = 3 WHERE ID = 2")
sql_i("UPDATE PETSALE SET QUANTITY = 2 WHERE ID = 3")
sql_i("UPDATE PETSALE SET QUANTITY = 6 WHERE ID = 4")
sql_i("UPDATE PETSALE SET QUANTITY = 24 WHERE ID = 5")

In [34]:
petsale=sql_i("SELECT * FROM PETSALE")
petsale=pd.DataFrame(petsale,columns=head)
petsale

   ID    ANIMAL  SALEPRICE    SALEDATE  QUANTITY QUANTITY1
0   1       Cat     450.09  2018-05-29         9      None
1   2       Dog     666.66  2018-06-01         3      None
2   3    Parrot      50.00  2018-06-04         2      None
3   4   Hamster      60.60  2018-06-11         6      None
4   5  Goldfish      48.48  2018-06-14        24      None
5   1       Cat     450.09      100.47         9      None
6   2       Dog     666.66      150.76         3      None
7   3    Parrot      50.00         8.9         2      None
8   4   Hamster      60.60          12         6      None
9   5  Goldfish      48.48         3.5        24      None

# Task B: ALTER using DROP COLUMN

In [35]:
#TO DO:DROP COLUMN PROFIT from table PETSALE and print output table
sql_i("ALTER TABLE PETSALE DROP COLUMN QUANTITY1")
columns=sql_i("PRAGMA table_info('PETSALE')")
head=[]
for name in columns:
    head.append(name[1])
petsale=sql_i("SELECT * FROM PETSALE")
petsale=pd.DataFrame(petsale,columns=head)
petsale

   ID    ANIMAL  SALEPRICE    SALEDATE  QUANTITY
0   1       Cat     450.09  2018-05-29         9
1   2       Dog     666.66  2018-06-01         3
2   3    Parrot      50.00  2018-06-04         2
3   4   Hamster      60.60  2018-06-11         6
4   5  Goldfish      48.48  2018-06-14        24
5   1       Cat     450.09      100.47         9
6   2       Dog     666.66      150.76         3
7   3    Parrot      50.00         8.9         2
8   4   Hamster      60.60          12         6
9   5  Goldfish      48.48         3.5        24

# Task C: ALTER using RENAME COLUMN

In [41]:
#TO DO:RENAME COLUMN PET TO ANIMAL in table PETSALE and print output table
# sql_i("ALTER TABLE PETSALE RENAME COLUMN ANIMAL TO PET")
columns=sql_i("PRAGMA table_info('PETSALE')")
head=[]
for name in columns:
    head.append(name[1])
petsale=sql_i("SELECT * FROM PETSALE")
petsale=pd.DataFrame(petsale,columns=head)
petsale

   ID       PET  SALEPRICE    SALEDATE  QUANTITY
0   1       Cat     450.09  2018-05-29         9
1   2       Dog     666.66  2018-06-01         3
2   3    Parrot      50.00  2018-06-04         2
3   4   Hamster      60.60  2018-06-11         6
4   5  Goldfish      48.48  2018-06-14        24
5   1       Cat     450.09      100.47         9
6   2       Dog     666.66      150.76         3
7   3    Parrot      50.00         8.9         2
8   4   Hamster      60.60          12         6
9   5  Goldfish      48.48         3.5        24

# Task D: DROP TABLE

In [44]:
#TO DO: DROP TABLE PET and print output 
# sql_i("DROP TABLE PETSALE")
columns=sql_i("PRAGMA table_info('PETSALE')")
head=[]
for name in columns:
    head.append(name[1])
petsale=sql_i("SELECT * FROM PETSALE")
petsale=pd.DataFrame(petsale,columns=head)
petsale

OperationalError: no such table: PETSALE